

# number(숫자형)
# - 정수
# - 실수
# - 복소수

# type(변수명 | 값) 함수 : 변수 또는 값의 타임을 확인하는 내장 함수

# 정수 (int) Integer
n = 123
print(n, type(n))

price = 1_000_000; # 정주 자릿수 구분

# 2진법, 8진법, 16진법
a = 0b100
print(a, type(a))

# -------------------------------------------
# 실수 (float)
f1 = 123.456
print(f1, type(f1))

f2 = -9999.9999
print(f2, type(f2))

# 소수점 아래 16자리까지 표현 가능
f3 = 1.01234567890123456789
print(f3, type(f3))

#---------------------------------
# 복소수 (complex)
c = 2j
print(c, type(c))

d = 3 + 4j
print(d, type(d))

#------------------------------
# 산술 연산 (+, -, *, /, //(몫), %(modulo, 나머지), **(거듭제곱))

print(1 + 2)
print(1 - 2)
print(1 * 2)
print(1 / 2) # 0.5 -> 나누어 떨어질 때 까지의 몫
print(1 // 2) # 0 -> 정수 영역에서의 몫
print(1 % 2) # 1 -> 정수 영역에서의 나머지

# 거듭제곱
print(3 ** 2)
print(3 ** 4)
print(2 ** 63) # int 양의 최대값